
--Εισαγωγή δεδομένων



-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΓΡΑΜΜΑΤΕΙΑ

INSERT INTO ΓΡΑΜΜΑΤΕΙΑ (Username, Password, Όνομα, Επώνυμο) 
VALUES ('admin', '1234', 'Μαρία', 'Παπαδοπούλου');

INSERT INTO ΓΡΑΜΜΑΤΕΙΑ (Username, Password, Όνομα, Επώνυμο) 
VALUES ('secr1', '1111', 'Γιώργος', 'Γεωργίου');

INSERT INTO ΓΡΑΜΜΑΤΕΙΑ (Username, Password, Όνομα, Επώνυμο) 
VALUES ('secr2', '0000', 'Ελένη', 'Νικολάου');


-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΚΑΘΗΓΗΤΗΣ

INSERT INTO ΚΑΘΗΓΗΤΗΣ (Κωδικός_καθ, Όνομα, Επώνυμο, Email, Βαθμίδα, Username_Γραμ) 
VALUES ('k101', 'Γεώργιος', 'Αλεξίου', 'alexiou@hua.gr', 'Καθηγητής', 'admin');

INSERT INTO ΚΑΘΗΓΗΤΗΣ (Κωδικός_καθ, Όνομα, Επώνυμο, Email, Βαθμίδα, Username_Γραμ) 
VALUES ('k102', 'Μαρία', 'Δημητρίου', 'dimitriou@hua.gr', 'Αναπληρωτής', 'admin');

INSERT INTO ΚΑΘΗΓΗΤΗΣ (Κωδικός_καθ, Όνομα, Επώνυμο, Email, Βαθμίδα, Username_Γραμ) 
VALUES ('k103', 'Κώστας', 'Παπαδόπουλος', 'kpap@hua.gr', 'Επίκουρος', 'secr1');

INSERT INTO ΚΑΘΗΓΗΤΗΣ (Κωδικός_καθ, Όνομα, Επώνυμο, Email, Βαθμίδα, Username_Γραμ) 
VALUES ('k104', 'Ελένη', 'Γεωργιάδου', 'egeorg@hua.gr', 'Λέκτορας', 'secr1');

INSERT INTO ΚΑΘΗΓΗΤΗΣ (Κωδικός_καθ, Όνομα, Επώνυμο, Email, Βαθμίδα, Username_Γραμ) 
VALUES ('k105', 'Νίκος', 'Οικονόμου', 'nikonomou@hua.gr', 'Καθηγητής', 'secr2');



-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΦΟΙΤΗΤΗΣ

INSERT INTO ΦΟΙΤΗΤΗΣ (ΑΜ_φοιτητή, Όνομα, Επώνυμο, Email, Διεύθυνση, Έτος_εισ, Username_Γραμ) 
VALUES ('ap26010', 'Ιωάννης', 'Παππάς', 'ipappas@hua.gr', 'Ελ. Βενιζέλου 12, Καλλιθέα', 1999, 'admin');

INSERT INTO ΦΟΙΤΗΤΗΣ (ΑΜ_φοιτητή, Όνομα, Επώνυμο, Email, Διεύθυνση, Έτος_εισ, Username_Γραμ) 
VALUES ('ap26011', 'Αικατερίνη', 'Λάμπρου', 'alamprou@hua.gr', 'Θησέως 45, Καλλιθέα', 1999, 'admin');

INSERT INTO ΦΟΙΤΗΤΗΣ (ΑΜ_φοιτητή, Όνομα, Επώνυμο, Email, Διεύθυνση, Έτος_εισ, Username_Γραμ) 
VALUES ('ap26012', 'Δημήτρης', 'Βασιλείου', 'dvasileiou@hua.gr', 'Σιβιτανίδου 8, Καλλιθέα', 1999, 'secr1');

INSERT INTO ΦΟΙΤΗΤΗΣ (ΑΜ_φοιτητή, Όνομα, Επώνυμο, Email, Διεύθυνση, Έτος_εισ, Username_Γραμ) 
VALUES ('ap26013', 'Σοφία', 'Κωνσταντίνου', 'skonstantinou@hua.gr', 'Δοϊράνης 22, Καλλιθέα', 2025, 'secr1');

INSERT INTO ΦΟΙΤΗΤΗΣ (ΑΜ_φοιτητή, Όνομα, Επώνυμο, Email, Διεύθυνση, Έτος_εισ, Username_Γραμ) 
VALUES ('ap26014', 'Χρήστος', 'Αντωνίου', 'chantoniou@hua.gr', 'Σοφοκλέους 10, Ταύρος', 2025, 'secr2');



-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΜΑΘΗΜΑ

INSERT INTO ΜΑΘΗΜΑ (Κωδικός_μαθ, Τίτλος, ECTS, Εξεταστική_περ, Τύπος, Κωδικός_καθ) 
VALUES ('CS101', 'Βάσεις Δεδομένων', 6.0, 'Χειμερινή', 'Υποχρεωτικό', 'k101');

INSERT INTO ΜΑΘΗΜΑ (Κωδικός_μαθ, Τίτλος, ECTS, Εξεταστική_περ, Τύπος, Κωδικός_καθ) 
VALUES ('CS102', 'Προγραμματισμός Java', 7.0, 'Χειμερινή', 'Υποχρεωτικό', 'k102');

INSERT INTO ΜΑΘΗΜΑ (Κωδικός_μαθ, Τίτλος, ECTS, Εξεταστική_περ, Τύπος, Κωδικός_καθ) 
VALUES ('CS201', 'Αλγόριθμοι', 5.0, 'Καλοκαιρινή', 'Υποχρεωτικό', 'k103');

INSERT INTO ΜΑΘΗΜΑ (Κωδικός_μαθ, Τίτλος, ECTS, Εξεταστική_περ, Τύπος, Κωδικός_καθ) 
VALUES ('CS305', 'Τεχνητή Νοημοσύνη', 5.0, 'Καλοκαιρινή', 'Επιλογής', 'k104');

INSERT INTO ΜΑΘΗΜΑ (Κωδικός_μαθ, Τίτλος, ECTS, Εξεταστική_περ, Τύπος, Κωδικός_καθ) 
VALUES ('CS402', 'Ασφάλεια Συστημάτων', 4.0, 'Καλοκαιρινή', 'Επιλογής', 'k105');



-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΔΗΛΩΣΗ_ΜΑΘ

INSERT INTO ΔΗΛΩΣΗ_ΜΑΘ (Κωδικός_δήλ, ΑΜ_φοιτητή, Κωδικός_μαθ, Ημερομηνία, Εξεταστική_περ) 
VALUES (1, 'ap26010', 'CS101', TO_DATE('2026-01-15', 'YYYY-MM-DD'), 'Χειμερινή');

INSERT INTO ΔΗΛΩΣΗ_ΜΑΘ (Κωδικός_δήλ, ΑΜ_φοιτητή, Κωδικός_μαθ, Ημερομηνία, Εξεταστική_περ) 
VALUES (2, 'ap26010', 'CS102', TO_DATE('2026-01-15', 'YYYY-MM-DD'), 'Χειμερινή');

INSERT INTO ΔΗΛΩΣΗ_ΜΑΘ (Κωδικός_δήλ, ΑΜ_φοιτητή, Κωδικός_μαθ, Ημερομηνία, Εξεταστική_περ) 
VALUES (3, 'ap26011', 'CS101', TO_DATE('2026-01-16', 'YYYY-MM-DD'), 'Χειμερινή');

INSERT INTO ΔΗΛΩΣΗ_ΜΑΘ (Κωδικός_δήλ, ΑΜ_φοιτητή, Κωδικός_μαθ, Ημερομηνία, Εξεταστική_περ) 
VALUES (4, 'ap26014', 'CS101', TO_DATE('2026-01-20', 'YYYY-MM-DD'), 'Χειμερινή');

INSERT INTO ΔΗΛΩΣΗ_ΜΑΘ (Κωδικός_δήλ, ΑΜ_φοιτητή, Κωδικός_μαθ, Ημερομηνία, Εξεταστική_περ) 
VALUES (5, 'ap26014', 'CS201', TO_DATE('2026-05-10', 'YYYY-MM-DD'), 'Καλοκαιρινή');



-- ΕΙΣΑΓΩΓΗ ΔΕΔΟΜΕΝΩΝ ΣΤΟΝ ΠΙΝΑΚΑ ΒΑΘΜΟΛΟΓΙΑ

INSERT INTO ΒΑΘΜΟΛΟΓΙΑ (ΑΜ_φοιτητή, Κωδικός_μαθ, Εξεταστική_περ, Βαθμός) 
VALUES ('ap26010', 'CS101', 'Χειμερινή', 8.5);

INSERT INTO ΒΑΘΜΟΛΟΓΙΑ (ΑΜ_φοιτητή, Κωδικός_μαθ, Εξεταστική_περ, Βαθμός) 
VALUES ('ap26010', 'CS102', 'Χειμερινή', 6.0);

INSERT INTO ΒΑΘΜΟΛΟΓΙΑ (ΑΜ_φοιτητή, Κωδικός_μαθ, Εξεταστική_περ, Βαθμός) 
VALUES ('ap26011', 'CS101', 'Χειμερινή', 3.5);

INSERT INTO ΒΑΘΜΟΛΟΓΙΑ (ΑΜ_φοιτητή, Κωδικός_μαθ, Εξεταστική_περ, Βαθμός) 
VALUES ('ap26014', 'CS101', 'Χειμερινή', 9.0);

INSERT INTO ΒΑΘΜΟΛΟΓΙΑ (ΑΜ_φοιτητή, Κωδικός_μαθ, Εξεταστική_περ, Βαθμός) 
VALUES ('ap26014', 'CS201', 'Καλοκαιρινή', 7.5);

-- Οριστική αποθήκευση στη βάση
COMMIT;